input_openfoam/tutorials/lagrangian/reactingParcelFoam/rivuletPanel/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|G)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0.1;
    }

    "(rho|G)Final"
    {
        $rho;
        tolerance       1e-05;
        relTol          0;
    }

    "(U|h)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       0;
        relTol          0.1;
    }

    "(U|h)Final"
    {
        $U;
        relTol          0;
        tolerance       1e-05;
    }

    "(k|epsilon)"
    {
        $UFinal;
    }

    p_rgh
    {
        solver          GAMG;
        tolerance       0;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    p_rghFinal
    {
        $p_rgh;
        tolerance       1e-06;
        relTol          0;
    }

    "(Yi|O2|N2|H2O)"
    {
        $hFinal;
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
    solvePrimaryRegion no;
}

relaxationFactors
{
    equations
    {
        ".*Final"       1;
    }
}


// ************************************************************************* //
